apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sce_type.h
/**************************************************************************//**
 * @file      rtl8710c_sce_sce_type.h
 * @brief
 * @version   V1.00
 * @date      2017-11-1 13:26:50
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef _RTL8710C_SCE_SCE_TYPE_H_
#define _RTL8710C_SCE_SCE_TYPE_H_

#ifdef  __cplusplus
extern "C"
{
#endif

/// @cond DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_SCE_REG_TYPE

/**
 * @addtogroup hal_sce_reg SCE Register Type.
 * @ingroup hs_hal_sce
 * @{
 */

/**
  \brief Union type to access sce_sce_ctrl (@ 0x00000000).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000000) SCE Control Register                                       */

  struct {
    __IOM uint32_t sce_en     : 1;            /*!< [0..0] Enable the SCE 0: Disable 1: Enable                                */
    __IOM uint32_t sce_mode_type : 2;         /*!< [2..1] 0: Read mode; SCE decrypts the instructions from the
                                                   external memory and pass through the data which CPU or
                                                   other master ports write into the external memory. 1: Write
                                                   mode; SCE encrypts the data which CPU or others master
                                                   write to the external memory or flash. For the reading
                                                   operation, SCE pass through data to the master port. 2:
                                                   Simultaneous mode; SCE encrypts the reading and writing
                                                   data from the mater ports including CPU and DMA port. 3:
                                                   Reserved.                                                                 */
    __IOM uint32_t sce_block_size : 3;        /*!< [5..3] Every secure section is separated by SCE_BLOCK_SIZE.
                                                   And SCE will adopt the same key to encrypt or decrypt every
                                                   secure block. 0: 32 Bytes 1: 64 Bytes 2: 128 Bytes 3: 256
                                                   Bytes 4~7: Reserved                                                       */
    __IOM uint32_t sce_page_size : 2;         /*!< [7..6] Based on the SCE_PAGE_SIZE, SCE separates the whole memory
                                                   and assigns the number in sequence. This option provides
                                                   the supporting maximum memory size because hardware just
                                                   provides the 12 bits to record the page number. 0: 16K
                                                   1: 32K 2: 64K 3: Reserved                                                 */
  } b;                                        /*!< bit fields for sce_sce_ctrl */
} sce_sce_ctrl_t, *psce_sce_ctrl_t;

/**
  \brief Union type to access sce_sce_aes_key_pair1_w0 (@ 0x00000010).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000010) SCE AES Key of the Pair 1 Word0 Register                   */

  struct {
    __IOM uint32_t aes_key_w0 : 32;           /*!< [31..0] The key bit[31:0]. The user chose the pair 1 to protect
                                                   the code. When SCE want encrypt or decrypt the data, it
                                                   needs this 128bits key.                                                   */
  } b;                                        /*!< bit fields for sce_sce_aes_key_pair1_w0 */
} sce_sce_aes_key_pair1_w0_t, *psce_sce_aes_key_pair1_w0_t;

/**
  \brief Union type to access sce_sce_aes_key_pair1_w1 (@ 0x00000014).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000014) SCE AES Key of the Pair 1 Word1 Register                   */

  struct {
    __IOM uint32_t aes_key_w1 : 32;           /*!< [31..0] The key bit[63:32]. The user chose the pair 1 to protect
                                                   the code. When SCE want encrypt or decrypt the data, it
                                                   needs this 128bits key.                                                   */
  } b;                                        /*!< bit fields for sce_sce_aes_key_pair1_w1 */
} sce_sce_aes_key_pair1_w1_t, *psce_sce_aes_key_pair1_w1_t;

/**
  \brief Union type to access sce_sce_aes_key_pair1_w2 (@ 0x00000018).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000018) SCE AES Key of the Pair 1 Word2 Register                   */

  struct {
    __IOM uint32_t aes_key_w2 : 32;           /*!< [31..0] The key bit[95:64]. The user chose the pair 1 to protect
                                                   the code. When SCE want encrypt or decrypt the data, it
                                                   needs this 128bits key.                                                   */
  } b;                                        /*!< bit fields for sce_sce_aes_key_pair1_w2 */
} sce_sce_aes_key_pair1_w2_t, *psce_sce_aes_key_pair1_w2_t;

/**
  \brief Union type to access sce_sce_aes_key_pair1_w3 (@ 0x0000001C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000001C) SCE AES Key of the Pair 1 Word3 Register                   */

