apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sce_type.h
  struct {
    __IOM uint32_t aes_iv_w0  : 32;           /*!< [31..0] The IV bit[31:0]. The user chose the pair 1 to protect
                                                   the code. When SCE want encrypt or decrypt the data, it
                                                   needs the initial vector generated by SCE_IV_KEY_PAIR_2.                  */
  } b;                                        /*!< bit fields for sce_sce_aes_iv_pair2_w0 */
} sce_sce_aes_iv_pair2_w0_t, *psce_sce_aes_iv_pair2_w0_t;

/**
  \brief Union type to access sce_sce_aes_iv_pair2_w1 (@ 0x00000044).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000044) SCE IV Key Word1 of the Pair 2 Register                    */

  struct {
    __IOM uint32_t aes_iv_w1  : 32;           /*!< [31..0] The IV bit[63:31]. The user chose the pair 1 to protect
                                                   the code. When SCE want encrypt or decrypt the data, it
                                                   needs the initial vector generated by SCE_IV_KEY_PAIR_2.                  */
  } b;                                        /*!< bit fields for sce_sce_aes_iv_pair2_w1 */
} sce_sce_aes_iv_pair2_w1_t, *psce_sce_aes_iv_pair2_w1_t;

/**
  \brief Union type to access sce_sce_aes_iv_pair2_w2 (@ 0x00000048).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000048) SCE IV Key Word2 of the Pair 2 Register                    */

  struct {
    __IOM uint32_t aes_iv_w2  : 32;           /*!< [31..0] The IV bit[95:64]. The user chose the pair 1 to protect
                                                   the code. When SCE want encrypt or decrypt the data, it
                                                   needs the initial vector generated by SCE_IV_KEY_PAIR_2.                  */
  } b;                                        /*!< bit fields for sce_sce_aes_iv_pair2_w2 */
} sce_sce_aes_iv_pair2_w2_t, *psce_sce_aes_iv_pair2_w2_t;

/**
  \brief Union type to access sce_sce_aes_iv_pair2_w3 (@ 0x0000004C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000004C) SCE IV Key Word3 of the Pair 2 Register                    */

  struct {
    __IOM uint32_t aes_iv_w3  : 32;           /*!< [31..0] The IV bit[127:96]. The user chose the pair 1 to protect
                                                   the code. When SCE want encrypt or decrypt the data, it
                                                   needs the initial vector generated by SCE_IV_KEY_PAIR_2.                  */
  } b;                                        /*!< bit fields for sce_sce_aes_iv_pair2_w3 */
} sce_sce_aes_iv_pair2_w3_t, *psce_sce_aes_iv_pair2_w3_t;

/**
  \brief Union type to access sce_sce_sect1 (@ 0x00000050).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000050) SCE Secure Section 1 Register                              */

  struct {
    __IOM uint32_t start_page : 12;           /*!< [11..0] If the users want to enable secure section, they need
                                                   configure the start page number. The definition of page
                                                   is defined in Chapter 4.                                                  */
    __IOM uint32_t end_page   : 12;           /*!< [23..12] If the users want to enable secure section, they need
                                                   configure the end page number. The definition of page is
                                                   defined in Chapter 4                                                      */
    __IOM uint32_t key_pair_id : 3;           /*!< [26..24] The users can chose one key pair from the two sets.
                                                   0: The key pair 1 1: The key pair 2                                       */
    __IOM uint32_t secure_en  : 1;            /*!< [27..27] data encryption control: 0: Data encryption of this
                                                   section is disabled. 1: Data encryption of this section
                                                   is enabled.                                                               */
    __IOM uint32_t remap_en   : 1;            /*!< [28..28] memory address remaping control 0: Address remapping
                                                   of this section is disabled. 1: Address remapping of this
                                                   section is enabled..                                                      */
  } b;                                        /*!< bit fields for sce_sce_sect1 */
} sce_sce_sect1_t, *psce_sce_sect1_t;

/**
  \brief Union type to access sce_sce_sect2 (@ 0x00000054).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000054) SCE Secure Section 2 Register                              */

  struct {
    __IOM uint32_t start_page : 12;           /*!< [11..0] If the users want to enable secure section, they need
                                                   configure the start page number. The definition of page
                                                   is defined in Chapter 4.                                                  */
    __IOM uint32_t end_page   : 12;           /*!< [23..12] If the users want to enable secure section, they need
                                                   configure the end page number. The definition of page is
                                                   defined in Chapter 4                                                      */
    __IOM uint32_t key_pair_id : 3;           /*!< [26..24] The users can chose one key pair from the two sets.
                                                   0: The key pair 1 1: The key pair 2                                       */
    __IOM uint32_t secure_en  : 1;            /*!< [27..27] data encryption control: 0: Data encryption of this
                                                   section is disabled. 1: Data encryption of this section
                                                   is enabled.                                                               */
    __IOM uint32_t remap_en   : 1;            /*!< [28..28] memory address remaping control 0: Address remapping
                                                   of this section is disabled. 1: Address remapping of this
                                                   section is enabled..                                                      */
  } b;                                        /*!< bit fields for sce_sce_sect2 */
} sce_sce_sect2_t, *psce_sce_sect2_t;

/**
  \brief Union type to access sce_sce_sect3 (@ 0x00000058).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000058) SCE Secure Section 3 Register                              */

