apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sce_type.h
  struct {
    __IOM uint32_t start_page : 12;           /*!< [11..0] If the users want to enable secure section, they need
                                                   configure the start page number. The definition of page
                                                   is defined in Chapter 4.                                                  */
    __IOM uint32_t end_page   : 12;           /*!< [23..12] If the users want to enable secure section, they need
                                                   configure the end page number. The definition of page is
                                                   defined in Chapter 4                                                      */
    __IOM uint32_t key_pair_id : 3;           /*!< [26..24] The users can chose one key pair from the two sets.
                                                   0: The key pair 1 1: The key pair 2                                       */
    __IOM uint32_t secure_en  : 1;            /*!< [27..27] data encryption control: 0: Data encryption of this
                                                   section is disabled. 1: Data encryption of this section
                                                   is enabled.                                                               */
    __IOM uint32_t remap_en   : 1;            /*!< [28..28] memory address remaping control 0: Address remapping
                                                   of this section is disabled. 1: Address remapping of this
                                                   section is enabled..                                                      */
  } b;                                        /*!< bit fields for sce_sce_sect7 */
} sce_sce_sect7_t, *psce_sce_sect7_t;

/**
  \brief Union type to access sce_sce_sect8 (@ 0x0000006C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000006C) SCE Secure Section 8 Register                              */

  struct {
    __IOM uint32_t start_page : 12;           /*!< [11..0] If the users want to enable secure section, they need
                                                   configure the start page number. The definition of page
                                                   is defined in Chapter 4.                                                  */
    __IOM uint32_t end_page   : 12;           /*!< [23..12] If the users want to enable secure section, they need
                                                   configure the end page number. The definition of page is
                                                   defined in Chapter 4                                                      */
    __IOM uint32_t key_pair_id : 3;           /*!< [26..24] The users can chose one key pair from the two sets.
                                                   0: The key pair 1 1: The key pair 2                                       */
    __IOM uint32_t secure_en  : 1;            /*!< [27..27] data encryption control: 0: Data encryption of this
                                                   section is disabled. 1: Data encryption of this section
                                                   is enabled.                                                               */
    __IOM uint32_t remap_en   : 1;            /*!< [28..28] memory address remaping control 0: Address remapping
                                                   of this section is disabled. 1: Address remapping of this
                                                   section is enabled..                                                      */
  } b;                                        /*!< bit fields for sce_sce_sect8 */
} sce_sce_sect8_t, *psce_sce_sect8_t;

/**
  \brief Union type to access sce_sce_remap1 (@ 0x00000070).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000070) SCE Secure Section Remap 1 Register                        */

  struct {
    __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                   by the Secure Section register.                                           */
  } b;                                        /*!< bit fields for sce_sce_remap1 */
} sce_sce_remap1_t, *psce_sce_remap1_t;

/**
  \brief Union type to access sce_sce_remap2 (@ 0x00000074).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000074) SCE Secure Section Remap 2 Register                        */

  struct {
    __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                   by the Secure Section register.                                           */
  } b;                                        /*!< bit fields for sce_sce_remap2 */
} sce_sce_remap2_t, *psce_sce_remap2_t;

/**
  \brief Union type to access sce_sce_remap3 (@ 0x00000078).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000078) SCE Secure Section Remap 3 Register                        */

  struct {
    __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                   by the Secure Section register.                                           */
  } b;                                        /*!< bit fields for sce_sce_remap3 */
} sce_sce_remap3_t, *psce_sce_remap3_t;

/**
  \brief Union type to access sce_sce_remap4 (@ 0x0000007C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000007C) SCE Secure Section Remap 4 Register                        */

  struct {
    __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                   by the Secure Section register.                                           */
  } b;                                        /*!< bit fields for sce_sce_remap4 */
} sce_sce_remap4_t, *psce_sce_remap4_t;

/**
  \brief Union type to access sce_sce_remap5 (@ 0x00000080).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000080) SCE Secure Section Remap 5 Register                        */

