apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sce_type.h
  struct {
    __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                   by the Secure Section register.                                           */
  } b;                                        /*!< bit fields for sce_sce_remap5 */
} sce_sce_remap5_t, *psce_sce_remap5_t;

/**
  \brief Union type to access sce_sce_remap6 (@ 0x00000084).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000084) SCE Secure Section Remap 6 Register                        */

  struct {
    __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                   by the Secure Section register.                                           */
  } b;                                        /*!< bit fields for sce_sce_remap6 */
} sce_sce_remap6_t, *psce_sce_remap6_t;

/**
  \brief Union type to access sce_sce_remap7 (@ 0x00000088).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000088) SCE Secure Section Remap 7 Register                        */

  struct {
    __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                   by the Secure Section register.                                           */
  } b;                                        /*!< bit fields for sce_sce_remap7 */
} sce_sce_remap7_t, *psce_sce_remap7_t;

/**
  \brief Union type to access sce_sce_remap8 (@ 0x0000008C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000008C) SCE Secure Section Remap 8 Register                        */

  struct {
    __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                   by the Secure Section register.                                           */
  } b;                                        /*!< bit fields for sce_sce_remap8 */
} sce_sce_remap8_t, *psce_sce_remap8_t;

/** @} */ /* End of group hal_sce_reg */
/// @endcond /* End of condition DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_SCE_REG_TYPE */


#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8710C_SCE_SCE_TYPE_H_

